bezier_coanda_pl/0/U
/*---------------------------------*- C++ -*-----------------------------------*/
//    //////////////      ///////////////
//    //////////////      //////////////
//         ////           ////             /////       ////  //  /// //// ////
//         ////     ////  ///////////   ///    ///  ///    ///   ////  ///  ///
//  ////   ////           ///////////   ///    ///  ///    ///   ///   ///  ///
//   //// ////            ////          ///    ///  ///    ///   ///   ///  ///
//     /////              ////            /////       ///// ///  ///   ///  ///
/*---------------------------------*- C++ -*-----------------------------------*/

// STEADY STATE BLOWING
FoamFile
{
		version			2.0;
		format			ascii;
		class				volVectorField;
		location		"0";
		object			U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

alpha				0.0;				 // Angle of Attack
U								25.0;						 // Mean Flow Speed


dimensions			[0 1 -1 0 0 0 0];

internalField		uniform  (#calc "$U * cos(degToRad($alpha))" #calc "$U*sin(degToRad($alpha))"  0);



boundaryField
{
		inOut
		{
				type            inletOutlet;
				inletValue      $internalField;
				value           $internalField;
		}

		surface
		{
				type						noSlip;
		}
    surfInner
    {
        type						noSlip;
    }

		coandaLower
		{
				type 						zeroGradient;
		}

		coandaUpper
		{
				type 						zeroGradient;
		}


		defaultFaces
		{
				type						empty;
		}
}

// ************************************************************************* //
