bezier_coanda_pl/0/p
/*---------------------------------*- C++ -*-----------------------------------*/
//    //////////////      ///////////////
//    //////////////      //////////////
//         ////           ////             /////       ////  //  /// //// ////
//         ////     ////  ///////////   ///    ///  ///    ///   ////  ///  ///
//  ////   ////           ///////////   ///    ///  ///    ///   ///   ///  ///
//   //// ////            ////          ///    ///  ///    ///   ///   ///  ///
//     /////              ////            /////       ///// ///  ///   ///  ///
/*---------------------------------*- C++ -*-----------------------------------*/

FoamFile
{
		version			2.0;
		format			ascii;
		class				volScalarField;
		object			p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions			[1 -1 -2 0 0 0 0];

internalField		uniform 100000;

boundaryField
{
		inOut
		{
				type						fixedValue;
				value						$internalField;
		}

		surface
		{
				type						zeroGradient;
		}
    surfInner
    {
        type		zeroGradient;
    }

		coandaUpper
		{
				// type zeroGradient;
				type 						fixedValue;
				value						uniform 105000.0;
		}
		coandaLower
		{
				// type zeroGradient;
				type 						fixedValue;
				value						uniform 100000;
		}

		defaultFaces
		{
				type						empty;
		}
}

// ************************************************************************* //
