bezier_coanda_pl/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inOut
    {
        type            patch;
        nFaces          190;
        startFace       20822;
    }
    coandaUpper
    {
        type            patch;
        nFaces          5;
        startFace       21012;
    }
    coandaLower
    {
        type            patch;
        nFaces          5;
        startFace       21017;
    }
    surface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          396;
        startFace       21022;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          21120;
        startFace       21418;
    }
)

// ************************************************************************* //
