bezier_coanda_pl/system/faces
boundary
(
    inOut
    {
        type patch;
        faces
        (
            ( 8  0  1  9)
            ( 0  2  3  1)
            (10  8  9 11)
            (14 10 11 15)
            ( 2 14 15  3)
        );
    }

    coandaUpper
    {
        type patch;
        faces
        (
            (38 40 41 39)
        );
    }

    coandaLower
    {
        type patch;
        faces
        (
            (50 52 53 51)
        );
    }

    surface
    {
        type wall;
        faces
        (
            ( 4 28 29  5)
            ( 4 36 37  5)
            (28 26 27 29)
            (26 24 25 27)
            (22 30 31 23)
            (32 34 35 33)
            (34 36 37 35)
            (58 30 31 59)
            (46 22 23 47)
            (48 24 25 49)
            (60 32 33 61)
            (40 42 43 41)
            (42 46 47 43)
            (44 48 49 45)
            (38 44 45 39)
            (50 56 57 51)
            (56 60 61 57)
            (52 54 55 53)
            (54 58 59 55)
        );
    }

    // surfInner
    // {
    //     type wall;
    //     faces
    //     (
    //         (40 42 43 41)
    //         (42 46 47 43)
    //         (44 48 49 45)
    //         (38 44 45 39)
    //         (50 56 57 51)
    //         (56 60 61 57)
    //         (52 54 55 53)
    //         (54 58 59 55)
    //     );
    // }


);
